Revit 2024 API
ConcreteBrightmodeType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteBrightmode" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ConcreteBrightmodeType
Visual Basic
Public Enumeration ConcreteBrightmodeType
Visual C++
public enum class ConcreteBrightmodeType
Members
Member name | Description
None
Automatic
Custom
See Also
Autodesk.Revit.DB.Visual Namespace